# Два отрезка на плоскости заданы координатами своих концов в декартовой системе координат.
# Требуется определить, существует ли у них общаяя точка.

# координаты точек отрезков
x11 = int(input())
y11 = int(input())
x12 = int(input())
y12 = int(input())
x21 = int(input())
y21 = int(input())
x22 = int(input())
y22 = int(input())

if ((x11 - x12) * (y21 - y22) - (y11 - y12) * (x21 - x22)) != 0:

    p1 = ((x11 * y12 - y11 * x12) * (x21 - x22) - (x11 - x12) * (x21 * y22 - y21 * x22)) / (
            (x11 - x12) * (y21 - y22) - (y11 - y12) * (x21 - x22))
    # p1 - первая координата точки пересечения прямых
    print(p1)
    p2 = ((x11 * y12 - y11 * x12) * (y21 - y22) - (y11 - y12) * (x21 * y22 - y21 * x22)) / (
            (x11 - x12) * (y21 - y22) - (y11 - y12) * (x21 - x22))
    # p2 - вторая координата точки пересечения прямых
    print(p2)

    if (x11 <= p1 <= x12) and (x21 <= p1 <= x22) and (y11 <= p2 <= y12) and (y21 <= p2 <= y22):
        print('exist')
    else:
        print('not exist')

else:
    print('not exist: parallel or congruent')
