# Для данных из таблицы tabl.png

# 1. Посчитать средний годовой балл для каждого из студентов и построить для полученных данных гистограмму (оси: средний
# балл, имя студента). 2. Для каждого предмета (рассматриваем только оценки за год) посчитать количество 5, 4, 3,
# 2 и построить круговые диаграммы (Имеется ввиду, для математики одна круговая диаграмма, на которой отображено
# количество 5, 3, 4 и 2 , для информатики другая, для физики третья).

import matplotlib.pyplot as plt

# оценки студентов
a1 = [[2, 2, 2], [3, 2, 3], [3, 2, 3]]
a2 = [[3, 3, 3], [3, 2, 3], [3, 3, 3]]
a3 = [[3, 3, 3], [3, 2, 3], [3, 3, 3]]
a4 = [[2, 3, 3], [3, 3, 3], [4, 3, 4]]
a5 = [[4, 4, 4], [3, 3, 3], [4, 4, 4]]
a6 = [[4, 4, 4], [5, 4, 5], [4, 4, 4]]
a7 = [[5, 5, 5], [5, 4, 5], [4, 4, 4]]
a8 = [[5, 5, 5], [5, 5, 5], [5, 5, 5]]
a9 = [[2, 3, 3], [4, 3, 4], [3, 3, 3]]
a10 = [[3, 3, 3], [4, 3, 4], [4, 4, 4]]
stud = ['Кощей', 'Кикимора', 'Змей', 'Яга', 'Леший', 'Илья', 'Добрыня', 'Василиса', 'Соловей', 'Иван']

# средний балл студентво
sr1 = (a1[0][2] + a1[1][2] + a1[2][2]) / 3
sr2 = (a2[0][2] + a2[1][2] + a3[2][2]) / 3
sr3 = (a3[0][2] + a3[1][2] + a3[2][2]) / 3
sr4 = (a4[0][2] + a4[1][2] + a4[2][2]) / 3
sr5 = (a5[0][2] + a5[1][2] + a5[2][2]) / 3
sr6 = (a6[0][2] + a6[1][2] + a6[2][2]) / 3
sr7 = (a7[0][2] + a7[1][2] + a7[2][2]) / 3
sr8 = (a8[0][2] + a8[1][2] + a8[2][2]) / 3
sr9 = (a9[0][2] + a9[1][2] + a9[2][2]) / 3
sr10 = (a10[0][2] + a10[1][2] + a10[2][2]) / 3

s = []  # все средние оценки всех студентво
s.extend((sr1, sr2, sr3, sr4, sr5, sr6, sr7, sr8, sr9, sr10))
m = []  # все годовые оценки по математике
m.extend([a1[0][2], a2[0][2], a3[0][2], a4[0][2], a5[0][2], a6[0][2], a7[0][2], a8[0][2], a9[0][2], a10[0][2]])
i = []  # все годовые оценки по информатике
i.extend([a1[1][2], a2[1][2], a3[1][2], a4[1][2], a5[1][2], a6[1][2], a7[1][2], a8[1][2], a9[1][2], a10[1][2]])
f = []  # все годовые оценки по физике
f.extend([a1[2][2], a2[2][2], a3[2][2], a4[2][2], a5[2][2], a6[2][2], a7[2][2], a8[2][2], a9[2][2], a10[2][2]])

# количество 2,3,4 и 5 по математике
m2 = m.count(2)
m3 = m.count(3)
m4 = m.count(4)
m5 = m.count(5)
mp = [m2, m2, m4, m5]

# количество 2,3,4 и 5 по информатике
i2 = i.count(2)
i3 = i.count(3)
i4 = i.count(4)
i5 = i.count(5)
ip = [i2, i3, i4, i5]

# количество 2,3,4 и 5 по физике
f2 = f.count(2)
f3 = f.count(3)
f4 = f.count(4)
f5 = f.count(5)
fp = [f2, f3, f4, f5]

# гистограмма средних оценок
fig, ax = plt.subplots()
fig.suptitle('Cредний годовой балл')
ax.barh(stud, s)
ax.label_outer()
ax.set_xlabel('Оценка')
ax.set_ylabel('Имя')

# круги кол-в оценок по каждому предмету
fig, (ax1, ax2, ax3) = plt.subplots(1, 3)
fig.suptitle('Кол-во оценок')
ax1.pie(mp, autopct='%1.1f%%', labels='2345')
ax2.pie(ip, autopct='%1.1f%%', labels='2345')
ax3.pie(fp, autopct='%1.1f%%', labels='2345')

ax1.set_xlabel('Математика')
ax2.set_xlabel('Информатика')
ax3.set_xlabel('Физика')
